Revit 2026 API

# FilledRegionCreate(Document, ElementId, ElementId, IListCurveLoop) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FilledRegion Create(
	Document document,
	ElementId typeId,
	ElementId viewId,
	IList<CurveLoop> boundaries
)
```
```vb
Public Shared Function Create (
	document As Document,
	typeId As ElementId,
	viewId As ElementId,
	boundaries As IList(Of CurveLoop)
) As FilledRegion
```
```cpp
public:
static FilledRegion^ Create(
	Document^ document,
	ElementId^ typeId,
	ElementId^ viewId,
	IList<CurveLoop^>^ boundaries
)
```
```fsharp
static member Create :
        document : Document *
        typeId : ElementId *
        viewId : ElementId *
        boundaries : IList<CurveLoop> -> FilledRegion
```

#### Parameters

document Document

typeId ElementId

viewId ElementId

boundaries IListCurveLoop

#### Return Value

FilledRegion

#### Reference

FilledRegion Class

Create Overload

Autodesk.Revit.DB Namespace